package be_study.quiz;

public class HW {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

		/*
		 * 1, 변수 개념 및 규칙
		 * 
		 * 1. 어떤 데이터를 저장할 수 있는 공간
		 * 2. X
		 * 3. X
		 * 4. $, _
		 * 5. X
		 * 6. O
		 * 7. X
		 * 8. b, c
		 * 9, c
		 * 10, O
		 * 11, X
		 * 12, =
		 * 13, 정수형인 x을 선언하고 10으로 초기화한다.
		 * 14, X
		 * 15. O
		 * -----------------------------------------------------
		 *  2, 변수 선언 및 초기화
		 *  
		 *  1, a
		 *  2, 2개
		 *  3, 1개 z  
		 *  4, 변수 초기화
		 *  5, O
		 *  6, O
		 *  7, c
		 *  8, boolean
		 *  9, O
		 *  10, O
		 *  11, 7
		 *  12, 15
		 *  13, b char는 ""이 아닌 ''로 써야함
		 *  14, syso -> Ctrl + Spacebar -> enter -> "오늘은 " + month + "월 " + day "일"
		 *  15, X
		 *  16, X
		 *  17, X
		 *  ----------------------------------------------------------
		 *  3, 데이터 타입의 이해
		 *  
		 *  1, int
		 *  2, char byte short int long
		 *  3, float double
		 *  4, String
		 *  5, A
		 *  6, true
		 *  7, String
		 *  8, 8bit -> -2^7~2^7-1
		 *  9, 16bit -> -2^15~2^15-1
		 *  10. 32bit -> 4byte
		 *  11, 8byte
		 * ---------------------------------------------------------------
		 * 4, 문자열과 문자 구분 
		 * 1, O
		 * 2, O
		 * 3, X
		 * 4, O
		 * 5, X
		 * 6, Hello Tom
		 * 7, +
		 * 8, HelloWorld
		 * 9, Hi3
		 * 10, 68
		 * ------------------------------------------------------------------
		 * 5, 출력 및 형 변환
		 * 
		 * 1, 안에 있는 것을 출력 후 줄을 바꿈
		 * 2, 줄을 안바꿈
		 * 3, 특정 형식들을 활용해 데이터들을 출력할 때
		 * 4, 10
		 * 5, 3.14
		 * 6, O
		 * 7, 3
		 * 8, 65
		 * 9, X
		 * 10, '5'
		 * 11, 11
		 * 12, 4.14
		 * 13, 100
		 * 14, O
		 * 15, 1020
		 * 16, 10
		 * 17, 2.5
		 * 18, 2
		 * 19, 2.5
		 */		

	}

}
